<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"66a2b86068d5667a0e45ed83ddd18f07f007a3c6293a2c305f6833854744d103","plan_job_ref":"Job Infrastructure #371 at https://github.com/coverage-robot/core/actions/runs/8161546569","plan_out_hash":"205de84650ecc4ac4033174e740804417b6f94a9e2af82b06b1f353ec9694c64","plan_hash":"38b73222ab4b70119888e5489777055f7ea8deb6c0796afb346bbe42d402d108","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
With var files: `./infrastructure/prod.tfvars`<details open><summary>With variables</summary>

```hcl
planetscale_service_token    = (sensitive value)
planetscale_service_token_id = (sensitive value)
```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.events.aws_iam_policy.coverage_event_scheduler_policy will be created
+   resource "aws_iam_policy" "coverage_event_scheduler_policy" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "coverage-event-scheduler-policy-prod"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Statement = [
+                           {
+                               Action   = [
+                                   "events:PutEvents",
                                ]
+                               Effect   = "Allow"
+                               Resource = [
+                                   {
+                                       arn               = "arn:aws:events:eu-west-2:952005856579:event-bus/coverage-events-prod"
+                                       event_source_name = null
+                                       id                = "coverage-events-prod"
+                                       name              = "coverage-events-prod"
+                                       tags              = {}
+                                       tags_all          = {}
                                    },
                                ]
                            },
                        ]
+                       Version   = "2012-10-17"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.events.aws_iam_role_policy_attachment.coverage_event_scheduler_policy_attachment will be created
+   resource "aws_iam_role_policy_attachment" "coverage_event_scheduler_policy_attachment" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "coverage-event-scheduler-role-prod"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
!~  line_coverage_table       = {
!~      etag                        = "LlR65LQ0obbri5DoznfmaA==" -> "sZCXTJEl9garj3GyNeJFrw=="
        id                          = "projects/coverage-384615/datasets/prod/tables/line_coverage"
!~      last_modified_time          = 1709664921866 -> 1709665044078
!~      num_bytes                   = 1843488668872 -> 1843493459974
!~      num_rows                    = 4297498673 -> 4297511102
!~      require_partition_filter    = null -> false
#        (25 unchanged attributes hidden)
    }
```
</details>

:memo: Plan generated in [Infrastructure #371](https://github.com/coverage-robot/core/actions/runs/8161546569)